app/controllers/pages_controller.rb

    def home
        @projects = Project.all
        @twoprojects = Twoproject.all
---
SELECT "projects".* FROM "projects"
SELECT "twoprojects".* FROM "twoprojects"