app/controllers/twoprojects_controller.rb

SELECT "twoprojects".* FROM "twoprojects"
---
  def index
    @twoprojects = Twoproject.all

INSERT INTO "twoprojects" ("title", "Sdescription", "Ldescription", "btnName", "btnUrl", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @twoproject = Twoproject.new(twoproject_params)

    respond_to do |format|
      if @twoproject.save

SELECT  "twoprojects".* FROM "twoprojects" WHERE "twoprojects"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_twoproject
      @twoproject = Twoproject.find(params[:id])